vseasky/bmi088-board/参考资料/122. YBX-BMI088(SPI)加速度传感器模块/示例代码（Arduino、STM32）/BMI088-STM32-master/BMI088-STM32-master/BMI088-STM32-master/BMI088_STM32/Inc/bmi08x_defs.h
/**
 * Copyright (C) 2017 - 2018 Bosch Sensortec GmbH
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions are met:
 *
 * Redistributions of source code must retain the above copyright
 * notice, this list of conditions and the following disclaimer.
 *
 * Redistributions in binary form must reproduce the above copyright
 * notice, this list of conditions and the following disclaimer in the
 * documentation and/or other materials provided with the distribution.
 *
 * Neither the name of the copyright holder nor the names of the
 * contributors may be used to endorse or promote products derived from
 * this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND
 * CONTRIBUTORS "AS IS" AND ANY EXPRESS OR
 * IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
 * WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL COPYRIGHT HOLDER
 * OR CONTRIBUTORS BE LIABLE FOR ANY
 * DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY,
 * OR CONSEQUENTIAL DAMAGES(INCLUDING, BUT NOT LIMITED TO,
 * PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
 * LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
 * HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
 * WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
 * (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
 * ANY WAY OUT OF THE USE OF THIS
 * SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE
 *
 * The information provided is believed to be accurate and reliable.
 * The copyright holder assumes no responsibility
 * for the consequences of use
 * of such information nor for any infringement of patents or
 * other rights of third parties which may result from its use.
 * No license is granted by implication or otherwise under any patent or
 * patent rights of the copyright holder.
 *
 * @file        bmi08x_defs.h
 * @date        24 Aug 2018
 * @version     1.2.0
 *
 */

/*! \file bmi08x_defs.h */
/*!
 * @defgroup BMI08 SENSOR API
 * @brief
 * @{*/
#ifndef BMI08X_DEFS_H_
#define BMI08X_DEFS_H_

/*********************************************************************/
/**\ header files */
#ifdef __KERNEL__
#include <linux/types.h>
#include <linux/kernel.h>
#else
#include <stdint.h>
#include <stddef.h>
#include <stdbool.h>
#endif

/*********************************************************************/
/** \name       Common macros                   */
/*********************************************************************/

#if !defined(UINT8_C) && !defined(INT8_C)
#define INT8_C(x)       S8_C(x)
#define UINT8_C(x)      U8_C(x)
#endif

#if !defined(UINT16_C) && !defined(INT16_C)
#define INT16_C(x)      S16_C(x)
#define UINT16_C(x)     U16_C(x)
#endif

#if !defined(INT32_C) && !defined(UINT32_C)
#define INT32_C(x)      S32_C(x)
#define UINT32_C(x)     U32_C(x)
#endif

#if !defined(INT64_C) && !defined(UINT64_C)
#define INT64_C(x)      S64_C(x)
#define UINT64_C(x)     U64_C(x)
#endif

/**\name C standard macros */
#ifndef NULL
#ifdef __cplusplus
#define NULL   0
#else
#define NULL   ((void *) 0)
#endif
#endif

#ifndef TRUE
#define TRUE     UINT8_C(1)
#endif

#ifndef FALSE
#define FALSE    UINT8_C(0)
#endif

/** \name enable bmi085 sensor */
#ifndef BMI08X_ENABLE_BMI085
#define BMI08X_ENABLE_BMI085       0
#endif
/** \name enable bmi088 sensor */
#ifndef BMI08X_ENABLE_BMI088
#define BMI08X_ENABLE_BMI088       1
#endif

/** \name enable bmi08x sensor */
#if BMI08X_ENABLE_BMI085 == 1
/** \name enable bmi085 sensor */
#define BMI08X_FEATURE_BMI085      1
/** \name disable bmi088 accel sensor */
#define BMI08X_FEATURE_BMI088      0

#elif BMI08X_ENABLE_BMI088 == 1

/** \name disable bmi085 sensor */
#define BMI08X_FEATURE_BMI085      0
/** \name enable bmi088 accel sensor */
#define BMI08X_FEATURE_BMI088      1
#endif

/*************************** BMI08 Accelerometer Macros *****************************/

/** Register map */
/* Accel registers */

/**\name    Accel Chip Id register */
#define BMI08X_ACCEL_CHIP_ID_REG                    UINT8_C(0x00)

/**\name    Accel Error condition register */
#define BMI08X_ACCEL_ERR_REG                        UINT8_C(0x02)

/**\name    Accel Status flag register */
#define BMI08X_ACCEL_STATUS_REG                     UINT8_C(0x03)

/**\name    Accel X LSB data register */
#define BMI08X_ACCEL_X_LSB_REG                      UINT8_C(0x12)

/**\name    Accel X MSB data register */
#define BMI08X_ACCEL_X_MSB_REG                      UINT8_C(0x13)

/**\name    Accel Y LSB data register */
#define BMI08X_ACCEL_Y_LSB_REG                      UINT8_C(0x14)

/**\name    Accel Y MSB data register */
#define BMI08X_ACCEL_Y_MSB_REG                      UINT8_C(0x15)

/**\name    Accel Z LSB data register */
#define BMI08X_ACCEL_Z_LSB_REG                      UINT8_C(0x16)

/**\name    Accel Z MSB data register */
#define BMI08X_ACCEL_Z_MSB_REG                      UINT8_C(0x17)

/**\name    Sensor time byte 0 register */
#define BMI08X_ACCEL_SENSORTIME_0_REG               UINT8_C(0x18)

/**\name    Sensor time byte 1 register */
#define BMI08X_ACCEL_SENSORTIME_1_REG               UINT8_C(0x19)

/**\name    Sensor time byte 2 register */
#define BMI08X_ACCEL_SENSORTIME_2_REG               UINT8_C(0x1A)

/**\name    Accel Interrupt status0 register */
#define BMI08X_ACCEL_INT_STAT_0_REG                 UINT8_C(0x1C)

/**\name    Accel Interrupt status1 register */
#define BMI08X_ACCEL_INT_STAT_1_REG                 UINT8_C(0x1D)

/**\name    Accel general purpose register 0*/
#define BMI08X_ACCEL_GP_0_REG                       UINT8_C(0x1E)

/**\name    Sensor temperature MSB data register */
#define BMI08X_TEMP_MSB_REG                         UINT8_C(0x22)

/**\name    Sensor temperature LSB data register */
#define BMI08X_TEMP_LSB_REG                         UINT8_C(0x23)

/**\name    Accel general purpose register 4*/
#define BMI08X_ACCEL_GP_4_REG                       UINT8_C(0x27)

