vseasky/bmi088-board/参考资料/122. YBX-BMI088(SPI)加速度传感器模块/示例代码（Arduino、STM32）/BMI088-STM32-master/BMI088-STM32-master/BMI088-STM32-master/BMI088_STM32/Inc/bmi08x_defs.h
/**\name    Accel Internal status register */
#define BMI08X_ACCEL_INTERNAL_STAT_REG              UINT8_C(0x2A)

/**\name    Accel configuration register */
#define BMI08X_ACCEL_CONF_REG                       UINT8_C(0x40)

/**\name    Accel range setting register */
#define BMI08X_ACCEL_RANGE_REG                      UINT8_C(0x41)

/**\name    Accel Interrupt pin 1 configuration register */
#define BMI08X_ACCEL_INT1_IO_CONF_REG               UINT8_C(0x53)

/**\name    Accel Interrupt pin 2 configuration register */
#define BMI08X_ACCEL_INT2_IO_CONF_REG               UINT8_C(0x54)

/**\name    Accel Interrupt latch configuration register */
#define BMI08X_ACCEL_INT_LATCH_CONF_REG             UINT8_C(0x55)

/**\name    Accel Interrupt pin1 mapping register */
#define BMI08X_ACCEL_INT1_MAP_REG                   UINT8_C(0x56)

/**\name    Accel Interrupt pin2 mapping register */
#define BMI08X_ACCEL_INT2_MAP_REG                   UINT8_C(0x57)

/**\name    Accel Interrupt map register */
#define BMI08X_ACCEL_INT1_INT2_MAP_DATA_REG         UINT8_C(0x58)

/**\name    Accel Init control register */
#define BMI08X_ACCEL_INIT_CTRL_REG                  UINT8_C(0x59)

/**\name    Accel Self test register */
#define BMI08X_ACCEL_SELF_TEST_REG                  UINT8_C(0x6D)

/**\name    Accel Power mode configuration register */
#define BMI08X_ACCEL_PWR_CONF_REG                   UINT8_C(0x7C)

/**\name    Accel Power control (switch on or off ) register */
#define BMI08X_ACCEL_PWR_CTRL_REG                   UINT8_C(0x7D)

/**\name    Accel Soft reset register */
#define BMI08X_ACCEL_SOFTRESET_REG                  UINT8_C(0x7E)

#if BMI08X_FEATURE_BMI085 == 1
/**\name    BMI085 Accel unique chip identifier */
#define BMI08X_ACCEL_CHIP_ID                        UINT8_C(0x1F)
#elif BMI08X_FEATURE_BMI088 == 1
/**\name    BMI088 Accel unique chip identifier */
#define BMI08X_ACCEL_CHIP_ID                        UINT8_C(0x1E)
#endif

/**\name    Accel I2C slave address */
#define BMI08X_ACCEL_I2C_ADDR_PRIMARY               UINT8_C(0x18)
#define BMI08X_ACCEL_I2C_ADDR_SECONDARY             UINT8_C(0x19)

/**\name    Feature Config related Registers */
#define BMI08X_ACCEL_RESERVED_5B_REG                UINT8_C(0x5B)
#define BMI08X_ACCEL_RESERVED_5C_REG                UINT8_C(0x5C)
#define BMI08X_ACCEL_FEATURE_CFG_REG                UINT8_C(0x5E)

/**\name    Interrupt masks */
#define BMI08X_ACCEL_DATA_READY_INT                 UINT8_C(0x80)

/**\name    Accel Bandwidth */
#define BMI08X_ACCEL_BW_OSR4                        UINT8_C(0x00)
#define BMI08X_ACCEL_BW_OSR2                        UINT8_C(0x01)
#define BMI08X_ACCEL_BW_NORMAL                      UINT8_C(0x02)

#if BMI08X_FEATURE_BMI085 == 1
/**\name    BMI085 Accel Range */
#define BMI085_ACCEL_RANGE_2G                       UINT8_C(0x00)
#define BMI085_ACCEL_RANGE_4G                       UINT8_C(0x01)
#define BMI085_ACCEL_RANGE_8G                       UINT8_C(0x02)
#define BMI085_ACCEL_RANGE_16G                      UINT8_C(0x03)

#elif BMI08X_FEATURE_BMI088 == 1

/**\name  BMI088 Accel Range */
#define BMI088_ACCEL_RANGE_3G                       UINT8_C(0x00)
#define BMI088_ACCEL_RANGE_6G                       UINT8_C(0x01)
#define BMI088_ACCEL_RANGE_12G                      UINT8_C(0x02)
#define BMI088_ACCEL_RANGE_24G                      UINT8_C(0x03)
#endif

/**\name    Accel Output data rate */
#define BMI08X_ACCEL_ODR_12_5_HZ                    UINT8_C(0x05)
#define BMI08X_ACCEL_ODR_25_HZ                      UINT8_C(0x06)
#define BMI08X_ACCEL_ODR_50_HZ                      UINT8_C(0x07)
#define BMI08X_ACCEL_ODR_100_HZ                     UINT8_C(0x08)
#define BMI08X_ACCEL_ODR_200_HZ                     UINT8_C(0x09)
#define BMI08X_ACCEL_ODR_400_HZ                     UINT8_C(0x0A)
#define BMI08X_ACCEL_ODR_800_HZ                     UINT8_C(0x0B)
#define BMI08X_ACCEL_ODR_1600_HZ                    UINT8_C(0x0C)

/**\name    Accel Self test */
#define BMI08X_ACCEL_SWITCH_OFF_SELF_TEST           UINT8_C(0x00)
#define BMI08X_ACCEL_POSITIVE_SELF_TEST             UINT8_C(0x0D)
#define BMI08X_ACCEL_NEGATIVE_SELF_TEST             UINT8_C(0x09)

/**\name    Accel Power mode */
#define BMI08X_ACCEL_PM_ACTIVE                      UINT8_C(0x00)
#define BMI08X_ACCEL_PM_SUSPEND                     UINT8_C(0x03)

/**\name    Accel Power control settings */
#define BMI08X_ACCEL_POWER_DISABLE                  UINT8_C(0x00)
#define BMI08X_ACCEL_POWER_ENABLE                   UINT8_C(0x04)

/**\name    Accel internal interrupt pin mapping */
#define BMI08X_ACCEL_INTA_DISABLE                   UINT8_C(0x00)
#define BMI08X_ACCEL_INTA_ENABLE                    UINT8_C(0x01)
#define BMI08X_ACCEL_INTB_DISABLE                   UINT8_C(0x00)
#define BMI08X_ACCEL_INTB_ENABLE                    UINT8_C(0x02)

/**\name    Accel Soft reset delay */
#define BMI08X_ACCEL_SOFTRESET_DELAY_MS             UINT8_C(1)

/**\name    Mask definitions for ACCEL_ERR_REG register */
#define BMI08X_FATAL_ERR_MASK                       UINT8_C(0x01)
#define BMI08X_ERR_CODE_MASK                        UINT8_C(0x1C)

/**\name    Position definitions for ACCEL_ERR_REG register */
#define BMI08X_CMD_ERR_POS                          UINT8_C(1)
#define BMI08X_ERR_CODE_POS                         UINT8_C(2)

/**\name    Mask definition for ACCEL_STATUS_REG register */
#define BMI08X_ACCEL_STATUS_MASK                    UINT8_C(0x80)

/**\name    Position definitions for ACCEL_STATUS_REG  */
#define BMI08X_ACCEL_STATUS_POS                     UINT8_C(7)

/**\name    Mask definitions for odr, bandwidth and range */
#define BMI08X_ACCEL_ODR_MASK                       UINT8_C(0x0F)
#define BMI08X_ACCEL_BW_MASK                        UINT8_C(0x70)
#define BMI08X_ACCEL_RANGE_MASK                     UINT8_C(0x03)

/**\name    Position definitions for odr, bandwidth and range */
#define BMI08X_ACCEL_BW_POS                         UINT8_C(4)

/**\name    Mask definitions for INT1_IO_CONF register */
#define BMI08X_ACCEL_INT_EDGE_MASK                  UINT8_C(0x01)
#define BMI08X_ACCEL_INT_LVL_MASK                   UINT8_C(0x02)
#define BMI08X_ACCEL_INT_OD_MASK                    UINT8_C(0x04)
#define BMI08X_ACCEL_INT_IO_MASK                    UINT8_C(0x08)
#define BMI08X_ACCEL_INT_IN_MASK                    UINT8_C(0x10)

/**\name    Position definitions for INT1_IO_CONF register */
#define BMI08X_ACCEL_INT_EDGE_POS                   UINT8_C(0)
#define BMI08X_ACCEL_INT_LVL_POS                    UINT8_C(1)
#define BMI08X_ACCEL_INT_OD_POS                     UINT8_C(2)
#define BMI08X_ACCEL_INT_IO_POS                     UINT8_C(3)
#define BMI08X_ACCEL_INT_IN_POS                     UINT8_C(4)

/**\name    Mask definitions for INT1/INT2 mapping register */
#define BMI08X_ACCEL_MAP_INTA_MASK                  UINT8_C(0x01)

/**\name    Mask definitions for INT1/INT2 mapping register */
#define BMI08X_ACCEL_MAP_INTA_POS                   UINT8_C(0x00)

/**\name    Mask definitions for INT1_INT2_MAP_DATA register */
#define BMI08X_ACCEL_INT1_DRDY_MASK                 UINT8_C(0x04)
#define BMI08X_ACCEL_INT2_DRDY_MASK                 UINT8_C(0x40)

/**\name    Position definitions for INT1_INT2_MAP_DATA register */
#define BMI08X_ACCEL_INT1_DRDY_POS                  UINT8_C(2)
#define BMI08X_ACCEL_INT2_DRDY_POS                  UINT8_C(6)

/**\name    Asic Initialization value */
#define BMI08X_ASIC_INITIALIZED                     UINT8_C(0x01)

/*************************** BMI08 Gyroscope Macros *****************************/
/** Register map */
/* Gyro registers */

/**\name    Gyro Chip Id register */
#define BMI08X_GYRO_CHIP_ID_REG                     UINT8_C(0x00)

/**\name    Gyro X LSB data register */
#define BMI08X_GYRO_X_LSB_REG                       UINT8_C(0x02)

/**\name    Gyro X MSB data register */
#define BMI08X_GYRO_X_MSB_REG                       UINT8_C(0x03)

/**\name    Gyro Y LSB data register */
#define BMI08X_GYRO_Y_LSB_REG                       UINT8_C(0x04)

/**\name    Gyro Y MSB data register */
#define BMI08X_GYRO_Y_MSB_REG                       UINT8_C(0x05)

/**\name    Gyro Z LSB data register */
#define BMI08X_GYRO_Z_LSB_REG                       UINT8_C(0x06)

/**\name    Gyro Z MSB data register */
#define BMI08X_GYRO_Z_MSB_REG                       UINT8_C(0x07)

/**\name    Gyro Interrupt status register */
#define BMI08X_GYRO_INT_STAT_1_REG                  UINT8_C(0x0A)

/**\name    Gyro Range register */
#define BMI08X_GYRO_RANGE_REG                       UINT8_C(0x0F)

/**\name    Gyro Bandwidth register */
#define BMI08X_GYRO_BANDWIDTH_REG                   UINT8_C(0x10)

/**\name    Gyro Power register */
#define BMI08X_GYRO_LPM1_REG                        UINT8_C(0x11)

/**\name    Gyro Soft reset register */
#define BMI08X_GYRO_SOFTRESET_REG                   UINT8_C(0x14)

/**\name    Gyro Interrupt control register */
#define BMI08X_GYRO_INT_CTRL_REG                    UINT8_C(0x15)

/**\name    Gyro Interrupt Pin configuration register */
#define BMI08X_GYRO_INT3_INT4_IO_CONF_REG           UINT8_C(0x16)

/**\name    Gyro Interrupt Map register */
#define BMI08X_GYRO_INT3_INT4_IO_MAP_REG            UINT8_C(0x18)

