vseasky/bmi088-board/参考资料/122. YBX-BMI088(SPI)加速度传感器模块/示例代码（Arduino、STM32）/BMI088-STM32-master/BMI088-STM32-master/BMI088-STM32-master/BMI088_STM32/Inc/bmi08x_defs.h
/**\name    Gyro Self test register */
#define BMI08X_GYRO_SELF_TEST_REG                   UINT8_C(0x3C)

/**\name    Gyro unique chip identifier */
#define BMI08X_GYRO_CHIP_ID                         UINT8_C(0x0F)

/**\name    Gyro I2C slave address */
#define BMI08X_GYRO_I2C_ADDR_PRIMARY                UINT8_C(0x68)
#define BMI08X_GYRO_I2C_ADDR_SECONDARY              UINT8_C(0x69)

/**\name    Gyro Range */
#define BMI08X_GYRO_RANGE_2000_DPS                  UINT8_C(0x00)
#define BMI08X_GYRO_RANGE_1000_DPS                  UINT8_C(0x01)
#define BMI08X_GYRO_RANGE_500_DPS                   UINT8_C(0x02)
#define BMI08X_GYRO_RANGE_250_DPS                   UINT8_C(0x03)
#define BMI08X_GYRO_RANGE_125_DPS                   UINT8_C(0x04)

/**\name    Gyro Output data rate and bandwidth */
#define BMI08X_GYRO_BW_532_ODR_2000_HZ              UINT8_C(0x00)
#define BMI08X_GYRO_BW_230_ODR_2000_HZ              UINT8_C(0x01)
#define BMI08X_GYRO_BW_116_ODR_1000_HZ              UINT8_C(0x02)
#define BMI08X_GYRO_BW_47_ODR_400_HZ                UINT8_C(0x03)
#define BMI08X_GYRO_BW_23_ODR_200_HZ                UINT8_C(0x04)
#define BMI08X_GYRO_BW_12_ODR_100_HZ                UINT8_C(0x05)
#define BMI08X_GYRO_BW_64_ODR_200_HZ                UINT8_C(0x06)
#define BMI08X_GYRO_BW_32_ODR_100_HZ                UINT8_C(0x07)
#define BMI08X_GYRO_ODR_RESET_VAL                   UINT8_C(0x80)

/**\name    Gyro Power mode */
#define BMI08X_GYRO_PM_NORMAL                       UINT8_C(0x00)
#define BMI08X_GYRO_PM_DEEP_SUSPEND                 UINT8_C(0x20)
#define BMI08X_GYRO_PM_SUSPEND                      UINT8_C(0x80)

/**\name    Gyro data ready interrupt enable value */
#define BMI08X_GYRO_DRDY_INT_DISABLE_VAL            UINT8_C(0x00)
#define BMI08X_GYRO_DRDY_INT_ENABLE_VAL             UINT8_C(0x80)

/**\name    Gyro data ready map values */
#define BMI08X_GYRO_MAP_DRDY_TO_INT3                UINT8_C(0x01)
#define BMI08X_GYRO_MAP_DRDY_TO_INT4                UINT8_C(0x80)
#define BMI08X_GYRO_MAP_DRDY_TO_BOTH_INT3_INT4      UINT8_C(0x81)

/**\name    Gyro Soft reset delay */
#define BMI08X_GYRO_SOFTRESET_DELAY                 UINT8_C(30)
/**\name    Gyro power mode config delay */
#define BMI08X_GYRO_POWER_MODE_CONFIG_DELAY         UINT8_C(30)

/** Mask definitions for range, bandwidth and power */
#define BMI08X_GYRO_RANGE_MASK                      UINT8_C(0x07)
#define BMI08X_GYRO_BW_MASK                         UINT8_C(0x0F)
#define BMI08X_GYRO_POWER_MASK                      UINT8_C(0xA0)

/** Position definitions for range, bandwidth and power */
#define BMI08X_GYRO_POWER_POS                       UINT8_C(5)

/**\name    Mask definitions for BMI08X_GYRO_INT_CTRL_REG register */
#define BMI08X_GYRO_DATA_EN_MASK                    UINT8_C(0x80)

/**\name    Position definitions for BMI08X_GYRO_INT_CTRL_REG register */
#define BMI08X_GYRO_DATA_EN_POS                     UINT8_C(7)

/**\name    Mask definitions for BMI08X_GYRO_INT3_INT4_IO_CONF_REG register */
#define BMI08X_GYRO_INT3_LVL_MASK                   UINT8_C(0x01)
#define BMI08X_GYRO_INT3_OD_MASK                    UINT8_C(0x02)
#define BMI08X_GYRO_INT4_LVL_MASK                   UINT8_C(0x04)
#define BMI08X_GYRO_INT4_OD_MASK                    UINT8_C(0x08)

/**\name    Position definitions for BMI08X_GYRO_INT3_INT4_IO_CONF_REG register */
#define BMI08X_GYRO_INT3_OD_POS                     UINT8_C(1)
#define BMI08X_GYRO_INT4_LVL_POS                    UINT8_C(2)
#define BMI08X_GYRO_INT4_OD_POS                     UINT8_C(3)

/**\name    Mask definitions for BMI08X_GYRO_INT_EN_REG register */
#define BMI08X_GYRO_INT_EN_MASK                     UINT8_C(0x80)

/**\name    Position definitions for BMI08X_GYRO_INT_EN_REG register */
#define BMI08X_GYRO_INT_EN_POS                      UINT8_C(7)

/**\name    Mask definitions for BMI088_GYRO_INT_MAP_REG register */
#define BMI08X_GYRO_INT3_MAP_MASK                   UINT8_C(0x01)
#define BMI08X_GYRO_INT4_MAP_MASK                   UINT8_C(0x80)

/**\name    Position definitions for BMI088_GYRO_INT_MAP_REG register */
#define BMI08X_GYRO_INT3_MAP_POS                    UINT8_C(0)
#define BMI08X_GYRO_INT4_MAP_POS                    UINT8_C(7)

/**\name    Mask definitions for BMI088_GYRO_INT_MAP_REG register */
#define BMI088_GYRO_INT3_MAP_MASK                   UINT8_C(0x01)
#define BMI088_GYRO_INT4_MAP_MASK                   UINT8_C(0x80)

/**\name    Position definitions for BMI088_GYRO_INT_MAP_REG register */
#define BMI088_GYRO_INT3_MAP_POS                    UINT8_C(0)
#define BMI088_GYRO_INT4_MAP_POS                    UINT8_C(7)
/**\name    Mask definitions for GYRO_SELF_TEST register */
#define BMI08X_GYRO_SELF_TEST_EN_MASK               UINT8_C(0x01)
#define BMI08X_GYRO_SELF_TEST_RDY_MASK              UINT8_C(0x02)
#define BMI08X_GYRO_SELF_TEST_RESULT_MASK           UINT8_C(0x04)
#define BMI08X_GYRO_SELF_TEST_FUNCTION_MASK         UINT8_C(0x08)

/**\name    Position definitions for GYRO_SELF_TEST register */
#define BMI08X_GYRO_SELF_TEST_RDY_POS               UINT8_C(1)
#define BMI08X_GYRO_SELF_TEST_RESULT_POS            UINT8_C(2)
#define BMI08X_GYRO_SELF_TEST_FUNCTION_POS          UINT8_C(3)

/*************************** Common Macros for both Accel and Gyro *****************************/
/**\name    SPI read/write mask to configure address */
#define BMI08X_SPI_RD_MASK                          UINT8_C(0x80)
#define BMI08X_SPI_WR_MASK                          UINT8_C(0x7F)

/**\name API success code */
#define BMI08X_OK                                   INT8_C(0)

/**\name API error codes */
#define BMI08X_E_NULL_PTR                INT8_C(-1)
#define BMI08X_E_COM_FAIL                INT8_C(-2)
#define BMI08X_E_DEV_NOT_FOUND               INT8_C(-3)
#define BMI08X_E_OUT_OF_RANGE                INT8_C(-4)
#define BMI08X_E_INVALID_INPUT               INT8_C(-5)
#define BMI08X_E_CONFIG_STREAM_ERROR             INT8_C(-6)
#define BMI08X_E_RD_WR_LENGTH_INVALID            INT8_C(-7)
#define BMI08X_E_INVALID_CONFIG              INT8_C(-8)
#define BMI08X_E_FEATURE_NOT_SUPPORTED               INT8_C(-9)

/**\name API warning codes */
#define BMI08X_W_SELF_TEST_FAIL              INT8_C(1)

/***\name    Soft reset Value */
#define BMI08X_SOFT_RESET_CMD                       UINT8_C(0xB6)

