vseasky/bmi088-board/参考资料/122. YBX-BMI088(SPI)加速度传感器模块/示例代码（Arduino、STM32）/BMI088-STM32-master/BMI088-STM32-master/BMI088-STM32-master/BMI088_STM32/Inc/bmi08x_defs.h
/**\name    Enable/disable macros */
#define BMI08X_DISABLE                              UINT8_C(0)
#define BMI08X_ENABLE                               UINT8_C(1)

/**\name    Constant values macros */
#define BMI08X_SENSOR_DATA_SYNC_TIME_MS             UINT8_C(1)
#define BMI08X_DELAY_BETWEEN_WRITES_MS              UINT8_C(1)
#define BMI08X_SELF_TEST_DELAY_MS                   UINT8_C(3)
#define BMI08X_POWER_CONFIG_DELAY                   UINT8_C(5)
#define BMI08X_SENSOR_SETTLE_TIME_MS                UINT8_C(30)
#define BMI08X_SELF_TEST_DATA_READ_MS               UINT8_C(50)
#define BMI08X_ASIC_INIT_TIME_MS                    UINT8_C(150)

#define BMI08X_CONFIG_STREAM_SIZE                   UINT16_C(6144)

/**\name    Sensor time array parameter definitions */
#define BMI08X_SENSOR_TIME_MSB_BYTE                 UINT8_C(2)
#define BMI08X_SENSOR_TIME_XLSB_BYTE                UINT8_C(1)
#define BMI08X_SENSOR_TIME_LSB_BYTE                 UINT8_C(0)

/**\name   int pin active state    */
#define BMI08X_INT_ACTIVE_LOW                       UINT8_C(0)
#define BMI08X_INT_ACTIVE_HIGH                      UINT8_C(1)

/**\name   interrupt pin output definition  */
#define BMI08X_INT_MODE_PUSH_PULL                   UINT8_C(0)
#define BMI08X_INT_MODE_OPEN_DRAIN                  UINT8_C(1)

/**\name    Sensor bit resolution   */
#define BMI08X_16_BIT_RESOLUTION                    UINT8_C(16)

/**\name    Absolute value */
#ifndef BMI08X_ABS
#define BMI08X_ABS(a)                               ((a) > 0 ? (a) : -(a))
#endif

/**\name    Utility Macros  */
#define BMI08X_SET_LOW_BYTE                         UINT16_C(0x00FF)
#define BMI08X_SET_HIGH_BYTE                        UINT16_C(0xFF00)
#define BMI08X_SET_LOW_NIBBLE                       UINT8_C(0x0F)

/**\name Macro to SET and GET BITS of a register*/
#define BMI08X_SET_BITS(reg_var, bitname, val) \
			((reg_var & ~(bitname##_MASK)) | \
			((val << bitname##_POS) & bitname##_MASK))

#define BMI08X_GET_BITS(reg_var, bitname)  ((reg_var & (bitname##_MASK)) >> \
											(bitname##_POS))

#define BMI08X_SET_BITS_POS_0(reg_var, bitname, val) \
					((reg_var & ~(bitname##_MASK)) | \
					(val & bitname##_MASK))

#define BMI08X_GET_BITS_POS_0(reg_var, bitname)     (reg_var & (bitname##_MASK))

#define BMI08X_SET_BIT_VAL_0(reg_var, bitname)      (reg_var & ~(bitname##_MASK))

/**\name     Macro definition for difference between 2 values */
#define BMI08X_GET_DIFF(x, y)       ((x) - (y))

/**\name     Macro definition to get LSB of 16 bit variable */
#define BMI08X_GET_LSB(var)         (uint8_t)(var & BMI08X_SET_LOW_BYTE)

/**\name     Macro definition to get MSB of 16 bit variable */
#define BMI08X_GET_MSB(var)         (uint8_t)((var & BMI08X_SET_HIGH_BYTE) >> 8)

/*************************************************************************/
/*!
 * @brief Interface selection enums
 */
enum bmi08x_intf {
/*! I2C interface */
BMI08X_I2C_INTF,
/*! SPI interface */
BMI08X_SPI_INTF
};
/*************************** Data structures *****************************/

/**\name    Typedef definitions */
/*!
 * @brief Bus communication function pointer which should be mapped to
 * the platform specific read and write functions of the user
 *
 *  @note : dev_addr is used for I2C read/write operations, as it holds 
 *          the i2c address. 
 *          For SPI read/write operations, this variable can be used by 
 *          the user to identify the corresponding chip select pin.
 */
typedef int8_t (*bmi08x_com_fptr_t)(uint8_t dev_addr, uint8_t reg_addr, uint8_t *data, uint16_t len);

/**\name    delay function pointer */
typedef void (*bmi08x_delay_fptr_t)(uint32_t period);

/**\name    Structure Definitions */

/*!
 *  @brief Sensor XYZ data structure
 */
struct bmi08x_sensor_data {
/*! X-axis sensor data */
int16_t x;
/*! Y-axis sensor data */
int16_t y;
/*! Z-axis sensor data */
int16_t z;
};

/*!
 *  @brief Sensor XYZ data structure in float representation
 */
struct bmi08x_sensor_data_f {
/*! X-axis sensor data */
float x;
/*! Y-axis sensor data */
float y;
/*! Z-axis sensor data */
float z;
};
/*!
 *  @brief Sensor configuration structure
 */
struct bmi08x_cfg {
/*! power mode */
uint8_t power;
/*! range */
uint8_t range;
/*! bandwidth */
uint8_t bw;
/*! output data rate */
uint8_t odr;
};

/*!
 *  @brief Error Status structure
 */
struct bmi08x_err_reg {
/*! Indicates fatal error */
uint8_t fatal_err;
/*! Indicates error code */
uint8_t err_code;
};

#define BMI08X_ACCEL_ANYMOTION_ADR 0x00
#define BMI08X_ACCEL_ANYMOTION_LEN 2
#define BMI08X_ACCEL_ANYMOTION_THRESHOLD_MASK 0x07FF
#define BMI08X_ACCEL_ANYMOTION_THRESHOLD_SHIFT 0
#define BMI08X_ACCEL_ANYMOTION_NOMOTION_SEL_MASK 0x0800
#define BMI08X_ACCEL_ANYMOTION_NOMOTION_SEL_SHIFT 11
#define BMI08X_ACCEL_ANYMOTION_DURATION_MASK 0x1FFF
#define BMI08X_ACCEL_ANYMOTION_DURATION_SHIFT 0
#define BMI08X_ACCEL_ANYMOTION_X_EN_MASK 0x2000
#define BMI08X_ACCEL_ANYMOTION_X_EN_SHIFT 13
#define BMI08X_ACCEL_ANYMOTION_Y_EN_MASK 0x4000
#define BMI08X_ACCEL_ANYMOTION_Y_EN_SHIFT 14
#define BMI08X_ACCEL_ANYMOTION_Z_EN_MASK 0x8000
#define BMI08X_ACCEL_ANYMOTION_Z_EN_SHIFT 15

/*!
 *  @brief Anymotion config structure
 */
struct bmi08x_anymotion_cfg {
/* 11 bit threshold of anymotion detection (threshold = X mg * 2,048 (5.11 format)) */
uint16_t threshold;
/* 1 bit select between any- and nomotion behavior */
uint16_t nomotion_sel;
/* 13 bit set the duration for any- and nomotion (time = duration * 20ms (@50Hz)) */
uint16_t duration;
/* enable anymotion detection for x axis */
uint16_t x_en;
/* enable anymotion detection for y axis */
uint16_t y_en;
/* enable anymotion detection for z axis */
uint16_t z_en;
};

#define BMI08X_ACCEL_DATA_SYNC_ADR 0x02
#define BMI08X_ACCEL_DATA_SYNC_LEN 1
#define BMI08X_ACCEL_DATA_SYNC_MODE_MASK 0x0003
#define BMI08X_ACCEL_DATA_SYNC_MODE_SHIFT 0

#define BMI08X_ACCEL_DATA_SYNC_MODE_OFF 0x00
#define BMI08X_ACCEL_DATA_SYNC_MODE_400HZ 0x01
#define BMI08X_ACCEL_DATA_SYNC_MODE_1000HZ 0x02
#define BMI08X_ACCEL_DATA_SYNC_MODE_2000HZ 0x03

/*!
 *  @brief Data Sync config structure
 */
struct bmi08x_data_sync_cfg {
/*! Mode (0 = off, 1 = 400Hz, 2 = 1kHz, 3 = 2kHz) */
uint8_t mode;
};

/*!
 *  @brief Enum to select accelerometer Interrupt pins
 */
enum bmi08x_accel_int_channel {
BMI08X_INT_CHANNEL_1, /* interrupt Channel 1 for accel sensor*/
BMI08X_INT_CHANNEL_2 /* interrupt Channel 2 for accel sensor*/
};

/*!
 *  @brief Enum to select gyroscope Interrupt pins
 */
enum bmi08x_gyro_int_channel {
BMI08X_INT_CHANNEL_3, /* interrupt Channel 3 for gyro sensor*/
BMI08X_INT_CHANNEL_4 /* interrupt Channel 4 for gyro sensor*/
};

/*!
 *  @brief Enum to select accelerometer interrupts
 */
enum bmi08x_accel_int_types {
BMI08X_ACCEL_DATA_RDY_INT,      /* Accel data ready interrupt */
BMI08X_ACCEL_SYNC_DATA_RDY_INT, /* Accel synchronized data ready interrupt */
BMI08X_ACCEL_SYNC_INPUT,        /* Accel synchronized data ready input*/
BMI08X_ACCEL_ANYMOTION_INT      /* Accel anymotion interrupt for BMI085 */
};

/*!
 *  @brief Enum to select gyroscope interrupts
 */
enum bmi08x_gyro_int_types {
BMI08X_GYRO_DATA_RDY_INT /* Gyro data ready interrupt */
};

/*!
 *  @brief Interrupt pin configuration structure
 */
struct bmi08x_int_pin_cfg {

/*! interrupt pin level configuration
* Assignable macros :
* - BMI08X_INT_ACTIVE_LOW
* - BMI08X_INT_ACTIVE_HIGH */
uint8_t lvl :1;

/*! interrupt pin mode configuration
* Assignable macros :
* - BMI08X_INT_MODE_PUSH_PULL
* - BMI08X_INT_MODE_OPEN_DRAIN */
uint8_t output_mode :1;

/*! Enable interrupt pin
* Assignable Macros :
* - BMI08X_ENABLE
* - BMI08X_DISABLE
*/
uint8_t enable_int_pin :1;
};

/*!
 *  @brief Interrupt channel structure for accel
 */
struct bmi08x_accel_int_channel_cfg {
/*! Accel Interrupt channel*/
enum bmi08x_accel_int_channel int_channel;
/*! Select Accel Interrupt type*/
enum bmi08x_accel_int_types int_type;
/*! Structure to configure accel interrupt pins*/
struct bmi08x_int_pin_cfg int_pin_cfg;
};

/*!
 *  @brief Interrupt channel structure for gyro
 */
struct bmi08x_gyro_int_channel_cfg {
/*! Gyro Interrupt channel*/
enum bmi08x_gyro_int_channel int_channel;
/*! Select Gyro Interrupt type*/
enum bmi08x_gyro_int_types int_type;
/*! Structure to configure gyro interrupt pins*/
struct bmi08x_int_pin_cfg int_pin_cfg;
};

/*!
 *  @brief Interrupt Configuration structure
 */
struct bmi08x_int_cfg {
/*! Configuration of first accel interrupt channel */
struct bmi08x_accel_int_channel_cfg accel_int_config_1;
/*! Configuration of second accel interrupt channel */
struct bmi08x_accel_int_channel_cfg accel_int_config_2;
/*! Configuration of first gyro interrupt channel */
struct bmi08x_gyro_int_channel_cfg gyro_int_config_1;
/*! Configuration of second gyro interrupt channel */
struct bmi08x_gyro_int_channel_cfg gyro_int_config_2;
};
/*!
 *  @brief
 *  This structure holds all relevant information about BMI08
 */
struct bmi08x_dev {
/*! Accel chip Id */
uint8_t accel_chip_id;
/*! Gyro chip Id */
uint8_t gyro_chip_id;
/*! Accel device Id in I2C mode, can be used for chip select pin in SPI mode */
uint8_t accel_id;
/*! Gyro device Id in I2C mode, can be used for chip select pin in SPI mode */
uint8_t gyro_id;
/*! 0 - I2C , 1 - SPI Interface */
enum bmi08x_intf intf;
/*! Decide SPI or I2C read mechanism */
uint8_t dummy_byte;
/*! Structure to configure accel sensor  */
struct bmi08x_cfg accel_cfg;
/*! Structure to configure gyro sensor  */
struct bmi08x_cfg gyro_cfg;
/*! Config stream data buffer address will be assigned*/
const uint8_t *config_file_ptr;
/*! Max read/write length (maximum supported length is 32).
To be set by the user */
uint8_t read_write_len;
/*! Read function pointer */
bmi08x_com_fptr_t read;
/*! Write function pointer */
bmi08x_com_fptr_t write;
/*! Delay function pointer */
bmi08x_delay_fptr_t delay_ms;
};

#endif /* BMI08X_DEFS_H_ */

/** @}*/

